app/controllers/question_longs_controller.rb

SELECT "question_longs".* FROM "question_longs"
---
  def index
    @question_longs = QuestionLong.all

INSERT INTO "question_longs" ("partOne", "ansWrongOne", "ansWrongTwo", "ansWrongThree", "ansRight", "partTwo", "ansWrongOne2", "ansWrongTwo2", "ansWrongThree2", "ansRight2", "partThree", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    @question_long = QuestionLong.new(question_long_params)
    respond_to do |format|
      if @question_long.save

UPDATE "question_longs" SET "ansWrongOne" = ?, "updated_at" = ? WHERE "question_longs"."id" = ?  [["ansWrongOne", "ой,ей"], ["updated_at", "2017-12-24 23:51:56.769164"], ["id", 20]]
---
  def update
    respond_to do |format|
      if @question_long.update(question_long_params)

DELETE FROM "question_longs" WHERE "question_longs"."id" = ?  [["id", 1]]
---
  def destroy
    @question_long.destroy

SELECT  "question_longs".* FROM "question_longs" WHERE "question_longs"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
---
    def set_question_long
      @question_long = QuestionLong.find(params[:id])