app/controllers/question_choices_controller.rb

SELECT "question_choices".* FROM "question_choices"
---
  def index
    @question_choices = QuestionChoice.all

INSERT INTO "question_choices" ("gender", "number", "word", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["gender", "feminine"], ["number", "plural"], ["word", "кошки"], ["created_at", "2017-12-28 04:11:48.258949"], ["updated_at", "2017-12-28 04:11:48.258949"]]
---
  def create
    @question_choice = QuestionChoice.new(question_choice_params)

    respond_to do |format|
      if @question_choice.save

DELETE FROM "question_choices" WHERE "question_choices"."id" = $1  [["id", 1]]
---
  def destroy
    @question_choice.destroy

SELECT  "question_choices".* FROM "question_choices" WHERE "question_choices"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_question_choice
      @question_choice = QuestionChoice.find(params[:id])