app/controllers/question_moves_controller.rb

  def index
    @question_moves = QuestionMove.all
---
SELECT "question_moves".* FROM "question_moves"

  def create
    @question_move = QuestionMove.new(question_move_params)

    respond_to do |format|
      if @question_move.save
---
INSERT INTO "question_moves" ("word", "gender", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["word", "Привет"], ["gender", "masculine"], ["created_at", "2017-12-25 18:48:21.878039"], ["updated_at", "2017-12-25 18:48:21.878039"]]

  def destroy
    @question_move.destroy
---
DELETE FROM "question_moves" WHERE "question_moves"."id" = $1  [["id", 1]]

    def set_question_move
      @question_move = QuestionMove.find(params[:id])
---
SELECT  "question_moves".* FROM "question_moves" WHERE "question_moves"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]