app/controllers/question_plurals_controller.rb

  def index
    @question_plurals = QuestionPlural.all
---
SELECT "question_plurals".* FROM "question_plurals"