app/controllers/tests_controller.rb

  def show
    if params["commit"]=="Next"

      @test.update_attributes(:active_tab=>@test.active_tab+1)
---
UPDATE "tests" SET "curr_score" = $1, "updated_at" = $2 WHERE "tests"."id" = $3  [["curr_score", 1], ["updated_at", "2017-12-30 05:14:15.040636"], ["id", 2]]

  def create
    @test = Test.new(test_params)
    questions_choice = QuestionChoice.all.sample(2);
    questions_move = QuestionMove.all.sample(2);
    questions_choice.each do |q|
      @test.questions_choice << q.id
---
SELECT "question_choices".* FROM "question_choices"
SELECT "question_moves".* FROM "question_moves"
INSERT INTO "tests" ("name", "questions_choice", "active_tab", "curr_score", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", ""], ["questions_choice", "{1,2}"], ["active_tab", "1"], ["curr_score", 0], ["created_at", "2017-12-30 03:44:21.217001"], ["updated_at", "2017-12-30 03:44:21.217001"]]

    def set_questions
      @question=QuestionLong.all[(params[:id].to_i*7)%QuestionLong.count]
      @questions=QuestionLong.all
      @arr1=@questions[0].ansWrongOne.split(/,/)
      @arr2=@questions[1].ansWrongOne.split(/,/)
      @arr3=@questions[2].ansWrongOne.split(/,/)
      @moves=QuestionMove.all
---
SELECT  "question_longs".* FROM "question_longs" ORDER BY "question_longs"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT COUNT(*) FROM "question_longs"
SELECT "question_moves".* FROM "question_moves"