app/views/tests/show.html.erb

SELECT  "question_moves".* FROM "question_moves" WHERE "question_moves"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    <div id="2a" class="tab-pane fade in <%=@test.active_tab==2 ? 'active' : 'disabled'%>">
         <div class="drag <%=QuestionMove.find(@test.questions_move[0]).gender%>"> <%=QuestionMove.find(@test.questions_move[0]).word%> </div>

SELECT  "question_choices".* FROM "question_choices" WHERE "question_choices"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
         <div class ="col-sm-2">
      <%=question=QuestionChoice.find(q).word%>